In [1]:
import pandas as pd
from sqlalchemy import create_engine, Column, Integer, String, Float, Date, MetaData, Table
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker

In [2]:
df= pd.read_csv("D:\Terrapay\Data\data.csv",encoding="Latin-1")

In [3]:
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12-01-2010,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12-01-2010,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12-01-2010,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12-01-2010,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12-01-2010,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12-09-2011,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12-09-2011,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12-09-2011,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12-09-2011,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12-09-2011,4.95,12680.0,France

In [4]:
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'], errors='coerce').dt.date
df.tail()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09,4.95,12680.0,France

In [5]:
df.isna().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate    308950
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [6]:
df['Description'].fillna('No Description', inplace=True)

C:\Users\Sharath Reddy\AppData\Local\Temp\ipykernel_27248\3890267654.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Description'].fillna('No Description', inplace=True)

In [7]:
df.dropna(subset=['InvoiceDate'], inplace=True)

# Option 2: Fill with a placeholder date (less recommended unless there's a specific placeholder date that makes sense)
df['InvoiceDate'].fillna(pd.to_datetime('2000-01-01'), inplace=True)

C:\Users\Sharath Reddy\AppData\Local\Temp\ipykernel_27248\16869088.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['InvoiceDate'].fillna(pd.to_datetime('2000-01-01'), inplace=True)

In [8]:
df['CustomerID'].fillna(-1, inplace=True)  # Using -1 as a placeholder for missing IDs

# Option 2: Drop rows with missing 'CustomerID'
df.dropna(subset=['CustomerID'], inplace=True)

C:\Users\Sharath Reddy\AppData\Local\Temp\ipykernel_27248\3588426849.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['CustomerID'].fillna(-1, inplace=True)  # Using -1 as a placeholder for missing IDs

In [9]:
df.isna().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 232959 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    232959 non-null  object
 1   StockCode    232959 non-null  object
 2   Description  232959 non-null  object
 3   Quantity     232959 non-null  int64
 4   InvoiceDate  232959 non-null  object
 5   UnitPrice    232959 non-null  float64
 6   CustomerID   232959 non-null  float64
 7   Country      232959 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 16.0+ MB

In [11]:
df.dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

In [12]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  232959.000000  232959.000000  232959.000000
mean        9.409536       4.886792   11336.945754
std       242.463831     135.139653    6855.034812
min    -80995.000000  -11062.060000      -1.000000
25%         1.000000       1.250000      -1.000000
50%         3.000000       2.100000   14307.000000
75%        10.000000       4.130000   16253.000000
max     80995.000000   38970.000000   18287.000000

In [13]:
df["Description"].value_counts()

Description
WHITE HANGING HEART T-LIGHT HOLDER    1034
REGENCY CAKESTAND 3 TIER               942
JUMBO BAG RED RETROSPOT                918
PARTY BUNTING                          727
LUNCH BAG RED RETROSPOT                704
                                      ...
BLACKCHRISTMAS TREE 30CM                 1
WOODLAND MINI RUCKSACK                   1
SPACEBOY MINI RUCKSACK                   1
PLAYING CARDS VINTAGE DOILEY             1
RETRO BROWN BALL ASHTRAY                 1
Name: count, Length: 3963, dtype: int64

In [14]:
df["Description"].unique()

array(['WHITE HANGING HEART T-LIGHT HOLDER', 'WHITE METAL LANTERN',
       'CREAM CUPID HEARTS COAT HANGER', ...,
       'AMETHYST 3 BEAD DROP EARRINGS',
       'CREAM HANGING HEART T-LIGHT HOLDER',
       'PAPER CRAFT , LITTLE BIRDIE'], dtype=object)

In [15]:
df['InvoiceDate'].value_counts()

InvoiceDate
2011-12-05    5331
2011-12-08    4940
2011-11-11    4089
2011-11-08    4070
2010-12-06    3878
              ...
2011-04-03     731
2011-07-03     602
2011-08-07     541
2011-05-01     452
2011-02-06     279
Name: count, Length: 127, dtype: int64

In [16]:
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09,4.95,12680.0,France

In [21]:
import pymysql

# Connection details
conn = pymysql.connect(host='localhost', user='root', password='Sharath@9224', db='terrapay')

# Cursor to execute query
cursor = conn.cursor()

# Create a list of tuples from the dataframe
values = [tuple(x) for x in df.values]

# SQL query for inserting data
sql = """
INSERT INTO terrapay (InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country)
VALUES (%s, %s, %s, %s, %s, %s, %s, %s)
"""

try:
    # Executing the SQL command
    cursor.executemany(sql, values)
    # Commit your changes in the database
    conn.commit()
    print("Data inserted using raw SQL successfully.")
except Exception as e:
    # Rolling back in case of error
    conn.rollback()
    print(f"An error occurred: {e}")

# Closing the connection
conn.close()

Data inserted using raw SQL successfully.

In [19]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
   ---------------------------------------- 0.0/44.8 kB ? eta -:--:--
   --------------------------- ------------ 30.7/44.8 kB 1.3 MB/s eta 0:00:01
   ---------------------------------------- 44.8/44.8 kB 548.1 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0